f32c/arduino/hardware/fpga/f32c/boards.txt
menu.cpu=CPU Architecture
menu.speed=CPU Speed
menu.ramsize=RAM Size
menu.protocol=Protocol
menu.pinmap=PIN Map
menu.bitstream=Upload Bitstream to
menu.jtag=JTAG

#
# FPGArduino ULX2S f32c SoC SRAM
#
fpga_ulx2s_sram.name=FER ULX2S (Lattice XP2, 1M SRAM, 81.25 MHz)
fpga_ulx2s_sram.build.extra_flags=--section-start=.init=0x80000000
fpga_ulx2s_sram.build.fcpu=81250000
fpga_ulx2s_sram.build.variant=generic
fpga_ulx2s_sram.build.mcu=f32c
fpga_ulx2s_sram.build.core=f32c
fpga_ulx2s_sram.upload.tool=ujprog
fpga_ulx2s_sram.upload.wait_for_upload_port=false
fpga_ulx2s_sram.upload.native_usb=false
fpga_ulx2s_sram.upload.maximum_size=1015808
fpga_ulx2s_sram.upload.protocol=bin
fpga_ulx2s_sram.upload.flags=-re
fpga_ulx2s_sram.menu.cpu.mips=MIPS
fpga_ulx2s_sram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_sram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}

#
# FPGArduino ULX2S f32c SoC BRAM
#
fpga_ulx2s_bram.name=FER ULX2S (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_ulx2s_bram.build.fcpu=81250000
fpga_ulx2s_bram.build.variant=generic
fpga_ulx2s_bram.build.mcu=f32c
fpga_ulx2s_bram.build.core=f32c
fpga_ulx2s_bram.upload.tool=ujprog
fpga_ulx2s_bram.upload.wait_for_upload_port=false
fpga_ulx2s_bram.upload.native_usb=false
fpga_ulx2s_bram.upload.maximum_size=15360
fpga_ulx2s_bram.upload.protocol=hex
fpga_ulx2s_bram.upload.flags=-P{serial.port} -ra
fpga_ulx2s_bram.menu.cpu.mips=MIPS
fpga_ulx2s_bram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_ulx2s_bram.menu.cpu.riscv=RISC-V
fpga_ulx2s_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_ulx2s_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Terasic DE0-Nano
#
fpga_de0_nano_bram.name=Terasic DE0-Nano (Altera Cyclone-IV, 32K BRAM, 100 MHz)
fpga_de0_nano_bram.build.fcpu=100000000
fpga_de0_nano_bram.build.variant=generic
fpga_de0_nano_bram.build.mcu=f32c
fpga_de0_nano_bram.build.core=f32c
fpga_de0_nano_bram.upload.tool=ujprog
fpga_de0_nano_bram.upload.wait_for_upload_port=false
fpga_de0_nano_bram.upload.native_usb=false
fpga_de0_nano_bram.upload.maximum_size=31744
fpga_de0_nano_bram.upload.protocol=hex
fpga_de0_nano_bram.upload.flags=-P{serial.port} -ra
fpga_de0_nano_bram.menu.cpu.mips=MIPS
fpga_de0_nano_bram.menu.cpu.mips.cpu.arch=mips
fpga_de0_nano_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_de0_nano_bram.menu.cpu.riscv=RISC-V
fpga_de0_nano_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_de0_nano_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Spartan-3 (3E, 3A, 3AN) Starter Kits
#
fpga_s3starter_bram.name=Xilinx Spartan Starter Kits (S3E/S3A, 32K BRAM, 70 MHz)
fpga_s3starter_bram.build.fcpu=70000000
fpga_s3starter_bram.build.variant=generic
fpga_s3starter_bram.build.mcu=f32c
fpga_s3starter_bram.build.core=f32c
fpga_s3starter_bram.upload.tool=ujprog
fpga_s3starter_bram.upload.wait_for_upload_port=false
fpga_s3starter_bram.upload.native_usb=false
fpga_s3starter_bram.upload.maximum_size=31744
fpga_s3starter_bram.upload.protocol=hex
fpga_s3starter_bram.upload.flags=-P{serial.port} -ra
fpga_s3starter_bram.menu.cpu.mips=MIPS
fpga_s3starter_bram.menu.cpu.mips.cpu.arch=mips
fpga_s3starter_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_s3starter_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_s3starter_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_s3starter_bram.menu.cpu.riscv=RISC-V
fpga_s3starter_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_s3starter_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_s3starter_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_s3starter_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Nexys-3
#
fpga_nexys3_bram.name=Digilent Nexyx-3 (Xilinx Spartan-6, 64K BRAM, 80 MHz)
fpga_nexys3_bram.build.fcpu=80000000
fpga_nexys3_bram.build.variant=generic
fpga_nexys3_bram.build.mcu=f32c
fpga_nexys3_bram.build.core=f32c
fpga_nexys3_bram.upload.tool=ujprog
fpga_nexys3_bram.upload.wait_for_upload_port=false
fpga_nexys3_bram.upload.native_usb=false
fpga_nexys3_bram.upload.maximum_size=64152
fpga_nexys3_bram.upload.protocol=hex
fpga_nexys3_bram.upload.flags=-P{serial.port} -ra
fpga_nexys3_bram.menu.cpu.mips=MIPS
fpga_nexys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_nexys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_nexys3_bram.menu.cpu.riscv=RISC-V
fpga_nexys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_nexys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Basys-3
#
fpga_basys3_bram.name=Digilent Basys-3 (Xilinx Artix-7, 128K BRAM, 100 MHz)
fpga_basys3_bram.build.fcpu=100000000
fpga_basys3_bram.build.variant=generic
fpga_basys3_bram.build.mcu=f32c
fpga_basys3_bram.build.core=f32c
fpga_basys3_bram.upload.tool=ujprog
fpga_basys3_bram.upload.wait_for_upload_port=false
fpga_basys3_bram.upload.native_usb=false
fpga_basys3_bram.upload.maximum_size=130048
fpga_basys3_bram.upload.protocol=hex
fpga_basys3_bram.upload.flags=-P{serial.port} -ra
fpga_basys3_bram.menu.cpu.mips=MIPS
fpga_basys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_basys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_basys3_bram.menu.cpu.riscv=RISC-V
fpga_basys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_basys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# ZYBO
#
fpga_zybo_bram.name=Digilent ZYBO (Xilinx Zynq 7010, 128K BRAM, 125 MHz)
fpga_zybo_bram.build.fcpu=125000000
fpga_zybo_bram.build.variant=generic
fpga_zybo_bram.build.mcu=f32c
fpga_zybo_bram.build.core=f32c
fpga_zybo_bram.upload.tool=ujprog
fpga_zybo_bram.upload.wait_for_upload_port=false
fpga_zybo_bram.upload.native_usb=false
fpga_zybo_bram.upload.maximum_size=130048
fpga_zybo_bram.upload.protocol=hex
fpga_zybo_bram.upload.flags=-P{serial.port} -ra
fpga_zybo_bram.menu.cpu.mips=MIPS
fpga_zybo_bram.menu.cpu.mips.cpu.arch=mips
fpga_zybo_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_zybo_bram.menu.cpu.riscv=RISC-V
fpga_zybo_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_zybo_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Lattice Brevia / Brevia2
#
fpga_brevia_bram.name=Lattice Brevia boards (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_brevia_bram.build.fcpu=81250000
fpga_brevia_bram.build.variant=generic
fpga_brevia_bram.build.mcu=f32c
fpga_brevia_bram.build.core=f32c
fpga_brevia_bram.upload.tool=ujprog
fpga_brevia_bram.upload.wait_for_upload_port=false
fpga_brevia_bram.upload.native_usb=false
fpga_brevia_bram.upload.maximum_size=15360
fpga_brevia_bram.upload.protocol=hex
fpga_brevia_bram.upload.flags=-P{serial.port} -ra
fpga_brevia_bram.menu.cpu.mips=MIPS
fpga_brevia_bram.menu.cpu.mips.cpu.arch=mips
fpga_brevia_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_brevia_bram.menu.cpu.riscv=RISC-V
fpga_brevia_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_brevia_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Xilinx TB299 Board (ebay), f32c SoC
#
fpga_tb299.name=TB299 (Xilinx Spartan-6 XC6SLX9)
fpga_tb299.build.mcu=f32c
fpga_tb299.build.core=f32c
fpga_tb299.upload.tool=ujprog
fpga_tb299.upload.wait_for_upload_port=false
fpga_tb299.upload.native_usb=false
fpga_tb299.upload.bitstream.command="openocd" "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command=svf -tap chip.tap {runtime.platform.path}/bootloaders/{bootloader.file_svf}" "--command=shutdown"
# fpga_tb299.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb299.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb299.cfg
fpga_tb299.menu.cpu.mips=MIPS
fpga_tb299.menu.cpu.mips.cpu.arch=mips
fpga_tb299.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb299.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb299.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb299.menu.cpu.mips.bootloader.file_svf=xc6slx9/xc6slx9_mips_112mhz.svf
fpga_tb299.menu.cpu.riscv=RISC-V
fpga_tb299.menu.cpu.riscv.cpu.arch=riscv
fpga_tb299.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb299.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb299.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb299.menu.cpu.riscv.bootloader.file_svf=xc6slx9/xc6slx9_riscv_112mhz.svf
fpga_tb299.menu.ramsize.32=32 KB BRAM Internal
fpga_tb299.menu.ramsize.32.upload.maximum_size=31744
fpga_tb299.menu.ramsize.32.build.extra_flags=--section-start=.init=0x200
fpga_tb299.menu.speed.112=112.5 MHz
fpga_tb299.menu.speed.112.build.fcpu=112500000
fpga_tb299.menu.protocol.bin=Hex 115.2 kbit/s no verify RS232
fpga_tb299.menu.protocol.bin.upload.protocol=hex
fpga_tb299.menu.protocol.bin.upload.flags=-P{serial.port} -ra
fpga_tb299.menu.pinmap.generic=Generic
fpga_tb299.menu.pinmap.generic.build.variant=generic
fpga_tb299.menu.jtag.alterablaster=Altera Blaster
fpga_tb299.menu.jtag.alterablaster.bootloader.openocd.interface=interface/altera-usb-blaster.cfg
fpga_tb299.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_tb299.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg

#
# Altera TB276 Board (ebay), f32c SoC
#
fpga_tb276.name=TB276 (Altera Cyclone IV E EP4CE6)
fpga_tb276.build.mcu=f32c
fpga_tb276.build.core=f32c
fpga_tb276.upload.tool=ujprog
fpga_tb276.upload.wait_for_upload_port=false
fpga_tb276.upload.native_usb=false
#fpga_tb276.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb276.cfg
fpga_tb276.menu.cpu.mips=MIPS
fpga_tb276.menu.cpu.mips.cpu.arch=mips
fpga_tb276.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb276.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb276.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb276.menu.cpu.mips.bootloader.file_jic=tb276/tb276_mips_112mhz.jic
fpga_tb276.menu.cpu.mips.bootloader.file_svf=tb276/tb276_mips_112mhz.svf
fpga_tb276.menu.cpu.riscv=RISC-V
fpga_tb276.menu.cpu.riscv.cpu.arch=riscv
fpga_tb276.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb276.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb276.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb276.menu.cpu.riscv.bootloader.file_jic=tb276/tb276_riscv_112mhz.jic
fpga_tb276.menu.cpu.riscv.bootloader.file_svf=tb276/tb276_riscv_112mhz.svf
fpga_tb276.menu.ramsize.16=16 KB BRAM Internal
fpga_tb276.menu.ramsize.16.upload.maximum_size=15360
fpga_tb276.menu.ramsize.16.build.extra_flags=--section-start=.init=0x200
fpga_tb276.menu.speed.112=112.5 MHz
fpga_tb276.menu.speed.112.build.fcpu=112500000
fpga_tb276.menu.protocol.bin=Hex 115.2 kbit/s no verify RS232
fpga_tb276.menu.protocol.bin.upload.protocol=hex
fpga_tb276.menu.protocol.bin.upload.flags=-P{serial.port} -ra
fpga_tb276.menu.pinmap.generic=Generic
fpga_tb276.menu.pinmap.generic.build.variant=generic
fpga_tb276.menu.jtag.alterablaster=Altera Blaster
fpga_tb276.menu.jtag.alterablaster.bootloader.openocd.interface=interface/altera-usb-blaster.cfg
fpga_tb276.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_tb276.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.menu.bitstream.sram=SRAM (temporary)
fpga_tb276.menu.bitstream.sram.upload.bitstream.command="openocd" "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command=svf -tap chip.tap {runtime.platform.path}/bootloaders/{bootloader.file_svf}" "--command=shutdown"
fpga_tb276.menu.bitstream.flash=FLASH (permanent)
fpga_tb276.menu.bitstream.flash.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IPV;{runtime.platform.path}/bootloaders/{bootloader.file_jic}"

